export const html = [
  {
    question: 'Що таке HTML і для чего використовується?',
    answer:
      'HTML (HyperText Markup Language) - це мова розмітки, яка використовується для створення і структурування веб-сторінок. Вона надає набір тегів, які визначають структуру і вміст сторінки, такі як заголовки, абзаци, списки, зображення і т. д. HTML використовується для створення вмісту веб-сторінок, який потім відображається веб-переглядачами.',
  },
  {
    question: 'Який doctype використовується для документів HTML5?',
    answer:
      'Doctype, який використовується для документів HTML5, виглядає так: <!DOCTYPE html>. Він повідомляє браузеру інтерпретувати документ як HTML5.',
  },
  {
    question: 'Які основні відмінності між HTML і XHTML?',
    answer:
      'Основні відмінності між HTML і XHTML такі: Суворість: XHTML є суворішою і більш чистою версією HTML. Вона відповідає правилам XML і вимагає більш точного синтаксису. Синтаксис: XHTML вимагає закриття тегів для всіх елементів і використання вкладених елементів у блокових елементах. Розширюваність: XHTML підтримує синтаксис, схожий на XML, що дозволяє використовувати власні теги і визначати простори імен.',
  },
  {
    question: 'Що таке відкриваючий і закриваючий теги в HTML?',
    answer:
      'Відкриваючі і закриваючі теги в HTML використовуються для позначення початку і кінця конкретного елемента. Відкриваючий тег виглядає як <tag>, а закриваючий тег виглядає як </tag>. Деякі елементи, такі як <br> або <img>, не мають закриваючого тегу і вважаються самозакриваючими.',
  },
  {
    question:
      'Які основні відмінності між блоковими та вбудованими елементами?',
    answer:
      ' Основні відмінності між блоковими та вбудованими елементами такі: Позиціонування: Блокові елементи (наприклад, <div> або <p>) займають повну доступну горизонтальну ширину і розпочинаються з нового рядка, тоді як вбудовані елементи (наприклад, <span> або <a>) займають лише необхідну ширину і залишаються в межах того ж рядка. Вкладеність: Блокові елементи можуть містити інші блокові та вбудовані елементи, тоді як вбудовані елементи можуть містити лише інші вбудовані елементи. Семантика: Блокові елементи використовуються для структурування вмісту, такого як створення секцій сторінки, тоді як вбудовані елементи, як правило, використовуються для форматування або позначення фрагментів тексту.',
  },
  {
    question: 'Як створити гіперпосилання в HTML?',
    answer:
      'Для створення гіперпосилання в HTML використовуйте тег <a> (anchor). Приклад: <a href="https://www.example.com">Посилання</a>. Атрибут href вказує URL або шлях до цільової сторінки, яку буде відкрито при кліку на посилання.',
  },
  {
    question: 'Що таке атрибут href і для чого він використовується?',
    answer:
      'Атрибут href в тезі <a> використовується для вказівки адреси (URL) або шляху до файлу, на який вказує гіперпосилання. Він повідомляє браузеру, куди перейти, коли клікнути на посилання.',
  },
  {
    question: 'Як додати зображення в документ HTML?',
    answer:
      'Для додавання зображення в документ HTML використовуйте тег <img>. Приклад: <img src="image.jpg" alt="Опис зображення">. Атрибут src вказує шлях до зображення, а alt надає текстовий опис зображення для випадків, коли воно не може бути відображене.',
  },
  {
    question: 'Як створити невпорядкований список (список з маркерами) в HTML?',
    answer:
      'Для створення невпорядкованого списку (списку з маркерами) в HTML використовуйте тег <ul> (невпорядкований список), а для кожного пункту списку - тег <li> (пункт списку).',
  },
  {
    question: 'Як створити впорядкований список (нумерований список) в HTML?',
    answer:
      'Для створення впорядкованого списку (нумерованого списку) в HTML використовуйте тег <ol> (впорядкований список), а для кожного пункту списку також використовуйте тег <li>. ',
  },
  {
    question: 'Як створити таблицю в HTML?',
    answer: 'Для створення таблиці в HTML використовуйте тег <table>.',
  },
  {
    question: 'Як вставити відео в HTML-документ?',
    answer: 'Для вставки відео в HTML-документ використовуйте тег <video>.',
  },
  {
    question: 'Що таке семантичні елементи в HTML?',
    answer:
      'Семантичні елементи в HTML - це теги, які надають значення та структуру документу, такі як <header>, <nav>, <section>, <article>, <footer> та інші.',
  },
  {
    question: 'Як вставити коментар в HTML-код?',
    answer:
      'Використовуйте <!-- ваш коментар --> для вставки коментаря в HTML-код.',
  },
  {
    question: 'Як створити форму в HTML?',
    answer: 'Для створення форми в HTML використовуйте тег <form>.',
  },
  {
    question: 'Який елемент використовується для створення поля вводу тексту?',
    answer:
      'Використовуйте тег <input> з атрибутом type="text" для створення поля вводу тексту.',
  },
  {
    question: 'Який елемент використовується для створення прапорців?',
    answer:
      'Використовуйте тег <input> з атрибутом type="checkbox" для створення прапорців.',
  },
  {
    question:
      'Який елемент використовується для створення випадаючого списку (select)?',
    answer: 'Використовуйте тег <select> для створення випадаючого списку.',
  },
  {
    question: 'Як створити заголовок розділу в HTML?',
    answer:
      'Для створення заголовку розділу в HTML використовуйте теги <h1> до <h6>.',
  },
  {
    question: 'Як створити горизонтальну лінію в HTML?',
    answer:
      'Використовуйте тег <hr> для створення горизонтальної лінії в HTML.',
  },
  {
    question: 'Як створити перенос рядка в HTML?',
    answer: 'Використовуйте тег <br> для створення переносу рядка в HTML.',
  },
  {
    question: 'Що таке блокові елементи?',
    answer:
      'Блокові елементи в HTML займають всю доступну ширину і утворюють блоки контенту, такі як <div>, <p>, <h1> та інші.',
  },
  {
    question: 'Як створити вбудовану рамку в HTML?',
    answer:
      'Використовуйте тег <iframe> для створення вбудованої рамки в HTML.',
  },
  {
    question: 'Як вставити спеціальні символи (наприклад, &) в HTML?',
    answer:
      'Використовуйте HTML-сутності для спеціальних символів, наприклад, &# для &, та інше.',
  },
  {
    question: 'Як включити стилі CSS в HTML-документ?',
    answer:
      'Використовуйте тег <link> з атрибутом rel="stylesheet" для посилання на зовнішній файл CSS або використовуйте тег <style> для внутрішніх стилів CSS.',
  },
  {
    question: 'Що таке мета-теги і як вони використовуються в HTML?',
    answer:
      'Мета-теги в HTML використовуються для надання інформації про документ, такої як кодування, опису, ключових слів та інших метаданих.',
  },
  {
    question: 'Як встановити мову вмісту в HTML-документі?',
    answer:
      'Використовуйте атрибут lang в тезі <html> для встановлення мови вмісту в HTML-документі, наприклад, lang="en" для англійської.',
  },
  {
    question: 'Як створити посилання для відправки електронної пошти в HTML?',
    answer:
      'Використовуйте тег <a> з атрибутом href="mailto:email_address" для створення посилання для відправки електронної пошти в HTML.',
  },
  {
    question: 'Як встановити фонове зображення для елемента в HTML?',
    answer:
      'Використовуйте властивість CSS background-image для встановлення фонового зображення для елемента в HTML.',
  },
  {
    question: 'Як створити абзац тексту в HTML?',
    answer: 'Використовуйте тег <p> для створення абзацу тексту в HTML.',
  },
  {
    question: 'Як встановити розмір шрифту в HTML?',
    answer:
      'Використовуйте властивість CSS font-size для встановлення розміру шрифту в HTML.',
  },
  {
    question:
      'Як створити вкладений інтерфейс з вкладками за допомогою HTML і CSS?',
    answer:
      'Для створення вкладок за допомогою HTML і CSS використовуйте поєднання тегів <ul>, <li> та стилів CSS для створення візуального ефекту вкладок.',
  },
  {
    question: 'Як створити випадаюче меню за допомогою HTML і CSS?',
    answer:
      'Для створення випадаючого меню за допомогою HTML і CSS використовуйте поєднання тегів <ul>, <li>, стилів CSS та властивості CSS display: none; для керування видимістю меню.',
  },
  {
    question: 'Як додати анімацію до HTML-документу?',
    answer:
      'Для додавання анімації до HTML-документу можна використовувати анімації CSS, переходи CSS або анімації JavaScript.',
  },
  {
    question: 'Як вставити аудіофайл в HTML-документ?',
    answer:
      'Використовуйте тег <audio> для вставки аудіофайлу в HTML-документ. Вкажіть шлях до аудіофайлу в атрибуті src.',
  },
  {
    question: 'Як включити скрипти JavaScript в HTML-документ?',
    answer:
      'Використовуйте тег <script> для включення скриптів JavaScript в HTML-документ. Ви можете вказати шлях до зовнішнього файлу скрипта або написати скрипт безпосередньо всередині тегу <script>.',
  },
  {
    question: 'Як створити кругову діаграму за допомогою HTML і CSS?',
    answer:
      'Для створення кругової діаграми за допомогою HTML і CSS можна використовувати поєднання тегів <div>, <span> та стилів CSS для створення сегментів діаграми і визначення їхнього розміру та кольору.',
  },
  {
    question: 'Як створити слайдер за допомогою HTML і CSS?',
    answer:
      'Для створення слайдера за допомогою HTML і CSS можна використовувати поєднання тегів <div>, <img>, <ul>, <li> та стилів CSS для створення візуального ефекту слайдера та керування його поведінкою.',
  },
  {
    question: 'Як зробити зображення клікабельним посиланням в HTML?',
    answer:
      'Оточіть тег <img> тегом <a> і встановіть атрибут href на посилання, на яке має вести зображення.',
  },
  {
    question: 'Як вставити відео з YouTube в HTML-документ?',
    answer:
      'Використовуйте вбудований код YouTube для вставки відео в HTML-документ. Ви можете отримати код зі сторінки відео на YouTube та вставити його в HTML за допомогою тегу <iframe>.',
  },
  {
    question: 'Як створити багатосторінковий HTML-документ?',
    answer:
      'Для створення багатосторінкового HTML-документа створюйте окремі HTML-файли для кожної сторінки та налаштовуйте посилання між ними.',
  },
  {
    question: 'Як створити випадаючий список за допомогою HTML і CSS?',
    answer:
      'Для створення випадаючого списку за допомогою HTML і CSS використовуйте тег <select> та вкладені теги <option>, разом зі стилями CSS для налаштування вигляду списку.',
  },
  {
    question: 'Як вставити інтерактивну карту Google Maps в HTML-документ?',
    answer:
      'Для вставки інтерактивної карти Google Maps в HTML-документ використовуйте Google Maps JavaScript API та вбудований код, який можна отримати на веб-сайті Google Maps.',
  },
  {
    question: 'Як встановити фонове відео для елемента в HTML?',
    answer:
      'Використовуйте властивість CSS background-video або <video> як фоновий елемент для встановлення фонового відео в HTML.',
  },
  {
    question: 'Як створити перемикач (toggle switch) за допомогою HTML і CSS?',
    answer:
      'Використовуйте тег <input> з атрибутом type="checkbox" і застосовуйте стилі CSS для створення візуального ефекту перемикача.',
  },
  {
    question: 'Як автоматично оновити сторінку в HTML?',
    answer:
      'Використовуйте елемент <meta> з атрибутом http-equiv="refresh" і вказуйте час у секундах для автоматичного оновлення сторінки.',
  },
  {
    question:
      'Як встановити метадані для пошукових систем (наприклад, ключові слова та опис) в HTML-документі?',
    answer:
      'Використовуйте елемент <meta> з атрибутами name="keywords" і name="description" для вказівки ключових слів і опису відповідно.',
  },
  {
    question: 'Як створити анімовану смужку прогресу за допомогою HTML і CSS?',
    answer:
      'Використовуйте елемент <div> зі стилями CSS, такими як width і background-color, і додайте анімацію за допомогою CSS-анімацій або псевдо-елементів.',
  },
  {
    question: 'Як зробити HTML-елементи доступними для пошукових систем (SEO)?',
    answer:
      'Переконайтеся, що ваш HTML-код семантично вірний, використовуйте відповідні теги, такі як <h1>, <p>, <img>, і додайте відповідні атрибути, такі як alt для зображень.',
  },
  {
    question: 'Як встановити фавікон (іконку сайту) в HTML-документі?',
    answer:
      'Вставте посилання на фавікон за допомогою елемента <link> і атрибута rel="icon" в розділі <head> вашого HTML-документа.',
  },
]
