import Header from '@/app/components/Header'
export default function MVC() {
  return (
    <>
      <Header />
      <div className="flex justify-center  h-screen bg-gray-100">
        <div className="bg-white shadow-md p-6 rounded-lg">
          <p className="text-gray-700">
            MVC - це скорочення від &#34;Model-View-Controller&#34;
            (Модель-Вид-Контролер) і є шаблоном архітектури програмного
            забезпечення, який використовується для організації коду в додатках,
            що розробляються на багатьох мовах програмування. MVC розділяє
            додаток на три основні компоненти:
          </p>
          <br></br>
          <p className="text-gray-700">
            Модель (Model): Модель представляє собою компонент, який відповідає
            за зберігання даних і бізнес-логіку. Це місце, де дані додатку
            обробляються, змінюються і перевіряються. Модель не залежить від
            представлення та контролера і забезпечує абстракцію даних.
          </p>
          <br></br>
          <p className="text-gray-700">
            Вид (View): Вид відповідає за відображення даних з моделі
            користувачу. Це компонент, який відповідає за візуальне
            представлення даних і взаємодію з користувачем. Вид отримує дані з
            моделі і відображає їх на екрані. Він не містить бізнес-логіки і не
            вносить змін у дані.
          </p>
          <br></br>
          <p className="text-gray-700">
            Контролер (Controller): Контролер є посередником між моделлю та
            видом. Він приймає вхідні дані від користувача через вид, обробляє
            їх і передає відповідним методам моделі для виконання операцій.
            Контролер також може оновлювати вид після зміни даних в моделі.
          </p>
          <br></br>
          <p className="text-gray-700">
            Основна ідея MVC полягає в тому, щоб розділити логіку додатку на ці
            три компоненти, що робить код більш організованим, підтримуваним і
            масштабованим. Цей шаблон часто використовується в веб-розробці, де
            модель може представляти базу даних, вид - веб-сторінку, а контролер
            - обробник запитів від клієнтів.
          </p>
          <br></br>
        </div>
      </div>
    </>
  )
}
