import Header from '@/app/components/Header'
export default function OSI() {
  return (
    <>
      <Header />
      <div className="flex justify-center  h-screen bg-gray-100">
        <div className="bg-white shadow-md p-6 rounded-lg">
          <p className="text-gray-700">
            Модель OSI (Open Systems Interconnection) — це концептуальна модель,
            що використовується для опису та розуміння роботи мережевих
            протоколів та комунікаційних систем. Вона була розроблена
            Міжнародною організацією зі стандартизації (ISO) та має сім рівнів,
            кожен із яких відповідає певному функціональному аспекту мережевого
            з&#39;єднання.
          </p>
          <br></br>
          <p className="text-gray-700">
            Основна ідея моделі OSI полягає в розділенні процесу мережевого
            з&#39;єднання на окремі рівні, кожен з яких виконує певну функцію та
            взаємодіє з рівнями вищого та нижчого рівнів. Ця модель допомагає
            стандартизувати та спрощувати розробку мережевих протоколів та
            систем, роблячи їх більш сумісними та надійними.
          </p>
          <br></br>
          <p className="text-gray-700">
            Основні рівні моделі OSI включають фізичний рівень (рівень 1),
            канальний рівень (рівень 2), мережевий рівень (рівень 3),
            транспортний рівень (рівень 4), сеансовий рівень (рівень 5), рівень
            представлення (рівень 6) та додатковий рівень (рівень 7).
          </p>
          <br></br>
          <p className="text-gray-700">
            Ця модель допомагає стандартизувати та спрощувати розробку мережевих
            протоколів та систем, роблячи їх більш сумісними та надійними.
          </p>
          <br></br>
        </div>
      </div>
    </>
  )
}
