import Header from '@/app/components/Header'
export default function BEM() {
  return (
    <>
      <Header />
      <div className="flex justify-center  h-screen bg-gray-100">
        <div className="bg-white shadow-md p-6 rounded-lg">
          <p className="text-gray-700">
            BEM, що означає Block-Element-Modifier (Блок-Елемент-Модифікатор), є
            популярною методологією для організації та структурування CSS-коду в
            веб-розробці. Вона надає системний підхід до найменування класів і
            визначення взаємозв&#39;язків між елементами в HTML та CSS.
          </p>
          <br></br>
          <p className="text-gray-700">
            Основною концепцією BEM є розбиття інтерфейсу користувача на окремі
            компоненти, які називаються блоками і є автономними та повторно
            використовуваними. Кожен блок представляє окремий розділ або модуль
            на веб-сторінці. Блоки отримують унікальні назви, що описують їх
            призначення або функціональність.
          </p>
          <br></br>
          <p className="text-gray-700">
            У кожному блоку є елементи, які є окремими частинами, що складають
            блок. Елементи називаються відносно їхнього батьківського блоку і
            розділяються подвійним підкресленням (__).
          </p>
          <br></br>
          <p className="text-gray-700">
            Модифікатори використовуються для зміни вигляду або поведінки блоків
            або елементів. Модифікатори дозволяють створювати різні варіації
            блоку або елемента без дублювання CSS-коду. Вони позначаються
            подвійними дефісами (--).
          </p>
          <br></br>
          <p className="text-gray-700">
            За допомогою BEM розробники можуть створювати модульний та
            підтримуваний CSS-код, який легко розуміти, навігувати та змінювати.
            Система найменувань і чітка структура, які надає BEM, допомагають у
            зменшенні конфліктів, покращенні співпраці та підвищенні
            масштабованості проектів з CSS.
          </p>
          <br></br>
        </div>
      </div>
    </>
  )
}
