export const quotes = [
  'Contra spem spero! - Леся Українка',
  'Більшість обмежень – це обмеження власних думок. - Френклін Рузвельт',
  'Перемога належить тому, хто вірить в свої мрії. - Елеонор Рузвельт',
  'Великі мрії починаються з маленьких кроків. - Харві Маккей',
  'Якщо в світі все безглуздо, – сказала Аліса, – що заважає вигадати якийсь сенс? - Льюїс Керролл',
  'Ваш час обмежений, не витрачайте його, живучи чужим життям. - Стів Джобс',
  'Перемога – це ще не все, все – це постійне бажання перемагати. - Вінс Ломбарді',
  'Ваш добробут залежить від ваших власних рішень. – Джон Д. Рокфеллер',
]
